tudzl/PIC-code/PIC18F16Q41_nano_QT7_test.X/mcc_generated_files/mtouch/mtouch_sensor.c
/*
    MICROCHIP SOFTWARE NOTICE AND DISCLAIMER:

    You may use this software, and any derivatives created by any person or
    entity by or on your behalf, exclusively with Microchip's products.
    Microchip and its subsidiaries ("Microchip"), and its licensors, retain all
    ownership and intellectual property rights in the accompanying software and
    in all derivatives hereto.

    This software and any accompanying information is for suggestion only. It
    does not modify Microchip's standard warranty for its products.  You agree
    that you are solely responsible for testing the software and determining
    its suitability.  Microchip has no obligation to modify, test, certify, or
    support the software.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE APPLY TO THIS SOFTWARE, ITS INTERACTION WITH MICROCHIP'S
    PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT, WILL MICROCHIP BE LIABLE, WHETHER IN CONTRACT, WARRANTY, TORT
    (INCLUDING NEGLIGENCE OR BREACH OF STATUTORY DUTY), STRICT LIABILITY,
    INDEMNITY, CONTRIBUTION, OR OTHERWISE, FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, FOR COST OR EXPENSE OF
    ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWSOEVER CAUSED, EVEN IF
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE
    FORESEEABLE.  TO THE FULLEST EXTENT ALLOWABLE BY LAW, MICROCHIP'S TOTAL
    LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED
    THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR
    THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF
    THESE TERMS.
*/
#include <xc.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>

#include "mtouch_sensor.h"
#include "../mcc.h"
#if _XTAL_FREQ == 64000000
    #define DELAY_SCALER                                     (uint8_t)3
#elif _XTAL_FREQ >= 32000000
    #define DELAY_SCALER                                     (uint8_t)2
#elif _XTAL_FREQ >= 16000000
    #define DELAY_SCALER                                     (uint8_t)1
#else
    #define DELAY_SCALER                                     (uint8_t)0
#endif

#define DELAY_CYCLE(cycle)                                  ((mtouch_sensor_time_t)cycle << DELAY_SCALER)

#define Sensor_calculate_cal_thrs(oversampling)             ((mtouch_sensor_packetsample_t)(oversampling)<<1)
#define Sensor_calculate_balance_point(oversampling)        ((mtouch_sensor_packetsample_t)(oversampling)<<9)

#define FH_NOISE_THRS                                       (mtouch_sensor_packetsample_t)100
#define FH_OVERLIMIT_THRS                                   (uint8_t)6
#define MTOUCH_SENSOR_SAMPLEDELAY_MIN                       (uint8_t)DELAY_CYCLE(0)
#define MTOUCH_SENSOR_SAMPLEDELAY_MAX                       (uint8_t)DELAY_CYCLE(15)
#define FRQ_0                                               (uint8_t)MTOUCH_SENSOR_SAMPLEDELAY_MIN
#define FRQ_1                                               (uint8_t)(MTOUCH_SENSOR_SAMPLEDELAY_MAX/2)
#define FRQ_2                                               (uint8_t)MTOUCH_SENSOR_SAMPLEDELAY_MAX

typedef uint16_t mtouch_sensor_adcsample_t;
#define MTOUCH_SENSOR_ADCSAMPLE_MIN ((mtouch_sensor_adcsample_t)0)
#define MTOUCH_SENSOR_ADCSAMPLE_MAX ((mtouch_sensor_adcsample_t)4095)

typedef uint8_t mtouch_sensor_packetcounter_t;
#define MTOUCH_SENSOR_PACKET_ADCSAMPLES ((mtouch_sensor_packetcounter_t)32)
#define MTOUCH_SENSOR_PACKETCOUNTER_MIN ((mtouch_sensor_packetcounter_t)0)
#define MTOUCH_SENSOR_PACKETCOUNTER_MAX ((mtouch_sensor_packetcounter_t)UINT8_MAX)

typedef uint16_t mtouch_sensor_packetsample_t;
#define MTOUCH_SENSOR_PACKETSAMPLE_MIN ((mtouch_sensor_packetsample_t)0)
#define MTOUCH_SENSOR_PACKETSAMPLE_MAX ((mtouch_sensor_packetsample_t)UINT16_MAX)


typedef uint8_t mtouch_sensor_delay_t;

typedef uint8_t mtouch_sensor_addcap_t;
#define ADD_CAP_LIMIT               (mtouch_sensor_addcap_t)31

typedef uint16_t mtouch_sensor_time_t;

#define MIN_PRECHARGE_TIME          ((mtouch_sensor_time_t)DELAY_CYCLE(1))
#define MIN_ACQ_TIME                ((mtouch_sensor_time_t)DELAY_CYCLE(1))
#define MAX_ACQ_TIME                ((mtouch_sensor_time_t)DELAY_CYCLE(48))
#define MAX_PRECHARGE_TIME          ((mtouch_sensor_time_t)DELAY_CYCLE(48))

typedef struct
{
 const  enum mtouch_sensor_names        sensor_name;
 const  uint8_t                         adpch;     
        mtouch_sensor_time_t            precharge_time;
        mtouch_sensor_time_t            acquisition_time;
        mtouch_sensor_packetcounter_t   oversampling;
        mtouch_sensor_addcap_t          addcap;
        mtouch_sensor_sample_t          rawSample;
        unsigned                        enabled:1;
        unsigned                        sampled:1;
        unsigned                        active:1;
        unsigned                        calibrated:1;       
        unsigned                        acqTime_cal:1;
} mtouch_sensor_t;

/*
 * =======================================================================
 * LOCAL FUNCTIONS
 * =======================================================================
 */
static void                     Sensor_setSamplePeriod      (void);
static void                     Sensor_scheduleNextScan     (void);
static inline void              MTOUCH_Sensor_Service       (void);

static void                     Sensor_SetTrisBit           (enum mtouch_sensor_names sensor,uint8_t TrisBit);
static inline void              Sensor_setSampled           (mtouch_sensor_t* sensor);
static inline void              Sensor_Sampled_Reset        (mtouch_sensor_t* sensor);
static inline void              Sensor_setActive            (mtouch_sensor_t* sensor);
static inline void              Sensor_setInactive          (mtouch_sensor_t* sensor);

static        bool              Sensor_isEnabled            (mtouch_sensor_t* sensor);
static        void              Sensor_setCalibratAcqTime   (mtouch_sensor_t* sensor);
static inline bool              Sensor_isCalibrated         (mtouch_sensor_t* sensor);
static        void              Sensor_setCalibrated        (mtouch_sensor_t* sensor);
static inline bool              Sensor_isCalibratingAcqTime (mtouch_sensor_t* sensor);
static enum mtouch_sensor_error Sensor_autoCalibration      (mtouch_sensor_t* sensor);

static void                     Sensor_FrequencyHopping     (void);
static void                     Sensor_FrequencyHopping_Autotune_Process(void);

static void                     Sensor_RawSample_Update     (mtouch_sensor_t* sensor);
static void                     Sensor_DefaultCallback       (enum mtouch_sensor_names sensor);

static mtouch_sensor_packetsample_t medianFilter(enum mtouch_sensor_names sensor);

