tudzl/PIC-code/PIC18F16Q41_nano_QT7_test.X/mcc_generated_files/mtouch/mtouch_sensor.c
/*
 * =======================================================================
 *  Callback Function Pointers
 * =======================================================================
 */
static void (*callback_sampled)(enum mtouch_sensor_names sensor) = Sensor_DefaultCallback;

/*
 * =======================================================================
 *  Local Variables
 * =======================================================================
 */
static mtouch_sensor_packetsample_t     sensor_medianBuffer[MTOUCH_SENSORS][3];
static mtouch_sensor_packetsample_t     packet_sample[MTOUCH_SENSORS];
static enum mtouch_sensor_names         currentScanSensor = 0;
static bool                             sampling_flag = false;
static volatile bool                    scanInterrupted = false;
static bool                             lowpowerActivated = false;

/*
 * =======================================================================
 *  Sensor runtime data
 * =======================================================================
 */
static uint8_t                          freq_index = 0;
static uint8_t                          freq_hop[3] = {FRQ_0,FRQ_1,FRQ_2};
static mtouch_sensor_delay_t            sample_delay = FRQ_0;    

/*
 * =======================================================================
 *  Sensor Configurations
 * =======================================================================
 */
const mtouch_sensor_t mtouch_sensor_init[MTOUCH_SENSORS] = {
    {   Sensor_ANA0,
        MTOUCH_SENSOR_ADPCH_Sensor_ANA0,
        DELAY_CYCLE(MTOUCH_SENSOR_PRECHARGE_Sensor_ANA0),
        DELAY_CYCLE(MTOUCH_SENSOR_ACQUISITION_Sensor_ANA0),
        MTOUCH_SENSOR_OVERSAMPLING_Sensor_ANA0,
        MTOUCH_SENSOR_ADDITIONALCAP_Sensor_ANA0,
        0,0,0,0,0,0
    },
    {   Sensor_ANC0,
        MTOUCH_SENSOR_ADPCH_Sensor_ANC0,
        DELAY_CYCLE(MTOUCH_SENSOR_PRECHARGE_Sensor_ANC0),
        DELAY_CYCLE(MTOUCH_SENSOR_ACQUISITION_Sensor_ANC0),
        MTOUCH_SENSOR_OVERSAMPLING_Sensor_ANC0,
        MTOUCH_SENSOR_ADDITIONALCAP_Sensor_ANC0,
        0,0,0,0,0,0
    },
    {   Sensor_ANA5,
        MTOUCH_SENSOR_ADPCH_Sensor_ANA5,
        DELAY_CYCLE(MTOUCH_SENSOR_PRECHARGE_Sensor_ANA5),
        DELAY_CYCLE(MTOUCH_SENSOR_ACQUISITION_Sensor_ANA5),
        MTOUCH_SENSOR_OVERSAMPLING_Sensor_ANA5,
        MTOUCH_SENSOR_ADDITIONALCAP_Sensor_ANA5,
        0,0,0,0,0,0
    },
    {   Sensor_ANC6,
        MTOUCH_SENSOR_ADPCH_Sensor_ANC6,
        DELAY_CYCLE(MTOUCH_SENSOR_PRECHARGE_Sensor_ANC6),
        DELAY_CYCLE(MTOUCH_SENSOR_ACQUISITION_Sensor_ANC6),
        MTOUCH_SENSOR_OVERSAMPLING_Sensor_ANC6,
        MTOUCH_SENSOR_ADDITIONALCAP_Sensor_ANC6,
        0,0,0,0,0,0
    },
    {   Sensor_ANC2,
        MTOUCH_SENSOR_ADPCH_Sensor_ANC2,
        DELAY_CYCLE(MTOUCH_SENSOR_PRECHARGE_Sensor_ANC2),
        DELAY_CYCLE(MTOUCH_SENSOR_ACQUISITION_Sensor_ANC2),
        MTOUCH_SENSOR_OVERSAMPLING_Sensor_ANC2,
        MTOUCH_SENSOR_ADDITIONALCAP_Sensor_ANC2,
        0,0,0,0,0,0
    },
};

static mtouch_sensor_t mtouch_sensor[MTOUCH_SENSORS];

/*
 * =======================================================================
 * MTOUCH_Sensor_Init()
 * =======================================================================
 */
enum mtouch_sensor_error MTOUCH_Sensor_Initialize(enum mtouch_sensor_names sensor)
{
    MTOUCH_Sensor_Enable(sensor);
    MTOUCH_Sensor_Calibrate(sensor);
    Sensor_Sampled_Reset(&mtouch_sensor[sensor]);
    
    return MTOUCH_SENSOR_ERROR_none;
}

static void Sensor_SetTrisBit(enum mtouch_sensor_names sensor,uint8_t TrisBit)
{
    switch(sensor)                                                     
    {
        case 0:  
            TRISAbits.TRISA0 = TrisBit;
            break; 
        case 1:  
            TRISCbits.TRISC0 = TrisBit;
            break; 
        case 2:  
            TRISAbits.TRISA5 = TrisBit;
            break; 
        case 3:  
            TRISCbits.TRISC6 = TrisBit;
            break; 
        case 4:  
            TRISCbits.TRISC2 = TrisBit;
            break; 
        default: break;
    }
}

/*
 * =======================================================================
 * MTOUCH_Sensor_ADCC_Initilaize
 * =======================================================================
 *  initialization for ADCC for CVD mode
 */
void MTOUCH_Sensor_ADCC_Initialize(void)
{
    
    // ADCCS  
    ADCLK = 0xf;
    // ADNREF VSS; ADPREF VDD;
    ADREF = 0x00;
    // ADCAP 0; 
    ADCAP = 0x00;
    // ADLTHL 0; 
    ADLTHL = 0x00;
    // ADLTHH 0; 
    ADLTHH = 0x00;
    // ADUTHL 0; 
    ADUTHL = 0x00;
    // ADUTHH 0; 
    ADUTHH = 0x00;
    // ADSTPTL 0; 
    ADSTPTL = 0x00;
    // ADSTPTH 0; 
    ADSTPTH = 0x00;
    
    // ADDSEN enabled; ADGPOL digital_low; ADIPEN enabled; ADPPOL VSS; 
    ADCON1 = 0x41;
    // ADCRS 0; ADMD Average Burst mode; ADACLR enabled; ADPSIS ADRES; Result right-shifted by 2bit in ADFLTR
    ADCON2 = 0xAB;

    // ADCALC First derivative of Single measurement; ADTMD enabled; ADSOI ADGO is cleared until ADTIF is triggered 
    ADCON3 = 0x0F;

    // ADGO stop; ADFM right; ADON enabled; ADCONT Enabled; ADCS FOSC/ADCLK; 
    ADCON0 = 0xC4;
   
    // Clear the ADC Threshold interrupt flag
    PIR2bits.ADTIF = 0;
    // Enabling ADCC threshold interrupt.
    PIE2bits.ADTIE = 1;
    
    
    ADCC_SetADTIInterruptHandler(ADCC_ThresholdISR_mTouch);
    
}


void MTOUCH_Sensor_InitializeAll(void)
{
    enum mtouch_sensor_names sensor; 
    
    memcpy(mtouch_sensor,mtouch_sensor_init,sizeof(mtouch_sensor_init));
    
    for (sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        MTOUCH_Sensor_Initialize(sensor);
    }
}


bool MTOUCH_Sensor_isSamplingComplete(void)
{
    enum mtouch_sensor_names sensor;   
    
    for (sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        if(MTOUCH_Sensor_wasSampled(sensor)==false && MTOUCH_Sensor_isEnabled(sensor))
        {   
            if(MTOUCH_Sensor_isSampling() == false)
            {
                Sensor_scheduleNextScan();
            }
            return false;
        }
    }
    
