tudzl/PIC-code/PIC18F16Q41_nano_QT7_test.X/mcc_generated_files/mtouch/mtouch_sensor.c
    return true;
}

bool MTOUCH_Sensor_SampleAll(void)
{
    if(MTOUCH_Sensor_isSamplingComplete() == false)
    {
        return false;
    }
    
    
    Sensor_FrequencyHopping();
    MTOUCH_Sensor_postAcquisitionProcess();
    
    return true;
}

bool MTOUCH_Sensor_isAnySensorActive(void)
{
    enum mtouch_sensor_names sensor;   
    
    for (sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        if(mtouch_sensor[sensor].active)
            return true;
    }
    
    return false;
}

void MTOUCH_Sensor_startLowpower(void)
{
    lowpowerActivated = true;
}

void MTOUCH_Sensor_exitLowpower(void)
{
    lowpowerActivated = false;
}

/*
 * =======================================================================
 * MTOUCH_Sensor_Scan_Initialize
 * =======================================================================
 *  initialization for ADC and pin module for guard/Tx
 */
void MTOUCH_Sensor_Scan_Initialize(void)
{
    MTOUCH_Sensor_ADCC_Initialize();
    
}

    
/*
 * =======================================================================
 * Sensor_scheduleNextScan()
 * =======================================================================
 */
static void Sensor_scheduleNextScan(void)
{
    mtouch_sensor_t* sensor;
    bool skipScan = (bool)false;
    bool state = (bool)GIE;
    
    
    while(MTOUCH_Sensor_wasSampled(currentScanSensor) || !MTOUCH_Sensor_isEnabled(currentScanSensor))
    {
        if(++currentScanSensor == MTOUCH_SENSORS)
        {
            currentScanSensor = 0;
            sampling_flag = false;
            skipScan = true;                    /* finished one round of sensor scan */
            break;
        }
    }
    
    
    if(skipScan==false)
    {
        sensor = &mtouch_sensor[currentScanSensor];
        if(Sensor_isCalibrated(sensor))
        {
            ADACQ = (mtouch_sensor_time_t)sensor->acquisition_time;
            ADPRE = (mtouch_sensor_time_t)sensor->precharge_time;
        }
        else
        {
            if(Sensor_isCalibratingAcqTime(sensor))
            {
                ADPRE = (mtouch_sensor_time_t)sensor->precharge_time;
                ADACQ = (mtouch_sensor_time_t)sensor->acquisition_time;
            }
            else
            {
                ADPRE = MAX_PRECHARGE_TIME;
                ADACQ = MAX_ACQ_TIME;
            }
        }

        ADPRE +=(uint8_t)sample_delay;           /* apply additional delay for freq hopping */
        ADPCH = (uint8_t)sensor->adpch;
        ADRPT = (uint8_t)(sensor->oversampling>>1);
        ADCAP = (uint8_t)sensor->addcap;
        ADCON0bits.ADON = 1;
        sampling_flag= true;
        Sensor_SetTrisBit(currentScanSensor,1);
        GIE = 0;
        ADCON0bits.GO = 1;
        ADACC = ((uint32_t)Sensor_calculate_balance_point(sensor->oversampling))<<2; /* scale up as the ADC is 12bit */
        GIE = state;
        scanInterrupted = false;
    }
}

/*
 * 
 *=======================================================================
 * Automatic Sensor Calibration for internal capacitor and acquisition time
 *=======================================================================
 *
 */
static enum mtouch_sensor_error Sensor_autoCalibration(mtouch_sensor_t* sensor)
{
    enum mtouch_sensor_names name = sensor->sensor_name;
 
    /* Calibrating internal capacitor */
    if(!Sensor_isCalibratingAcqTime(sensor))                   
    {
        if(ADFLTR > Sensor_calculate_balance_point(sensor->oversampling))
        {
            if(++(sensor->addcap) >= ADD_CAP_LIMIT)
                Sensor_setCalibratAcqTime(sensor);
        }
        else
        {
             Sensor_setCalibratAcqTime(sensor);
        }
    }
    else                        
    /* Calibrating acquisition time */
    {
        if((mtouch_sensor_packetsample_t)abs(packet_sample[name] - ADFLTR) < Sensor_calculate_cal_thrs(sensor->oversampling))
        {
            sensor->precharge_time = MAX_PRECHARGE_TIME;
            Sensor_setCalibrated(sensor);
        }
        else
        {
            if((sensor->acquisition_time) >= (mtouch_sensor_time_t)(MAX_ACQ_TIME - DELAY_CYCLE(2)))
            {
                sensor->precharge_time = MAX_PRECHARGE_TIME;
                Sensor_setCalibrated(sensor);
            }
            else
            {
                /* Using Increment of 2 to ensure enough margin when
                   finger is touching the sensor */
                sensor->acquisition_time += DELAY_CYCLE(2); 
            }
        }    
    }
    
    return MTOUCH_SENSOR_ERROR_none;
}

/*
 * =======================================================================
 * MTOUCH_Sensor_postAcquisitionProcess()
 * =======================================================================
 * 
 */
void MTOUCH_Sensor_postAcquisitionProcess(void)
{
    enum mtouch_sensor_names name;
    
    for (name = 0; name < MTOUCH_SENSORS; name++)
    {
        if(mtouch_sensor[name].sampled)
        {     
            Sensor_RawSample_Update(&mtouch_sensor[name]);
            callback_sampled(name);
        }
    }
}

void MTOUCH_Sensor_ScanInterruptNotify(void)
{
    scanInterrupted = true;
}


void ADCC_ThresholdISR_mTouch(void)
{
    // Clear the ADC Threshold interrupt flag
    PIR2bits.ADTIF = 0;
    MTOUCH_Sensor_Service();
}

/*
 * =======================================================================
 * MTOUCH_Sensor_Service()
 * =======================================================================
 * This function is a callback of ADACC ADTIF interrupt service
 */
static inline void MTOUCH_Sensor_Service(void)
{
    mtouch_sensor_t* sensor;
    
    Sensor_SetTrisBit(currentScanSensor,0);
    
    if(scanInterrupted)
    {
        ADCON0bits.ADON = 0;
    }
    else
    {                  
        ADCON0bits.ADON = 0;
        sensor = &mtouch_sensor[currentScanSensor];
        if(!Sensor_isCalibrated(sensor))
        {
            Sensor_autoCalibration(sensor);
        }
        else
        {
            Sensor_setSampled(sensor); 
        }

        if((mtouch_sensor_packetsample_t)
                abs(packet_sample[currentScanSensor] - ADFLTR) > 
                MTOUCH_SENSOR_ACTIVE_THRESHOLD)
        {
            mtouch_sensor[currentScanSensor].active = true;
        }
        else
        {
            mtouch_sensor[currentScanSensor].active = false;
        }
        
        /* Stop update the packet_sample in low power mode, so that the current 
           sensor reading will compare with the last sensor reading in normal 
           power mode.
        */    
        
        if(!lowpowerActivated)    
            packet_sample[currentScanSensor] = ADFLTR;                               
    }
    Sensor_scheduleNextScan();
}
/*
 * =======================================================================
 * Sensor_setSamplePeriod()
 * =======================================================================
 * This function rotates the sensor scan frequency from the frequency pool 
 */
static void Sensor_setSamplePeriod(void)
{
    if(++freq_index >= sizeof(freq_hop) )
        freq_index = 0;    

    sample_delay = freq_hop[freq_index];     
}
/*
 * =======================================================================
 * Sensor Raw Sample
 * =======================================================================
 */ 
mtouch_sensor_sample_t MTOUCH_Sensor_RawSample_Get(enum mtouch_sensor_names name) /* Global */
{
    if (name < MTOUCH_SENSORS)
    {
        return mtouch_sensor[name].rawSample;
    }
    else
        return (mtouch_sensor_sample_t)0;
}

mtouch_sensor_sample_t MTOUCH_Sensor_CVDSample_Get(enum mtouch_sensor_names name) /* Global */
{
    if (name < MTOUCH_SENSORS)
    {
        return packet_sample[name];
    }
    else
        return (mtouch_sensor_sample_t)0;
}
static void Sensor_RawSample_Update(mtouch_sensor_t* sensor) /* Local */
{
    mtouch_sensor_sample_t result = medianFilter(sensor->sensor_name);
    
