tudzl/PIC-code/PIC18F16Q41_nano_QT7_test.X/mcc_generated_files/mtouch/mtouch_sensor.c
    if (GIE == (uint8_t)1)
    {
        GIE = (uint8_t)0;
        sensor->rawSample = result;
        GIE = (uint8_t)1;
    }
    else
    {
        sensor->rawSample = result;
    }
}


static mtouch_sensor_packetsample_t medianFilter(enum mtouch_sensor_names sensor)
{
    static uint8_t bufferIndex[MTOUCH_SENSORS];
    
    sensor_medianBuffer[sensor][bufferIndex[sensor]++] = packet_sample[sensor];
    
    if(bufferIndex[sensor]>=3)
        bufferIndex[sensor] = 0;
    
    if(sensor_medianBuffer[sensor][0]>=sensor_medianBuffer[sensor][1])
    {
        if(sensor_medianBuffer[sensor][1]>=sensor_medianBuffer[sensor][2])
            return sensor_medianBuffer[sensor][1];
        else
        {   
            if(sensor_medianBuffer[sensor][0]>=sensor_medianBuffer[sensor][2])
                return sensor_medianBuffer[sensor][2];
            else
                return sensor_medianBuffer[sensor][0];
        }
            
    }
    else
    {   
        if(sensor_medianBuffer[sensor][0]>=sensor_medianBuffer[sensor][2])
            return sensor_medianBuffer[sensor][0];
        else
        {
            if(sensor_medianBuffer[sensor][1]>=sensor_medianBuffer[sensor][2])
                return sensor_medianBuffer[sensor][2];
            else
                return sensor_medianBuffer[sensor][1];
        }     
    }
}

/*
 *=========================================================================
 * Sensor Frequency Hopping
 *=========================================================================
 */
static void Sensor_FrequencyHopping(void)
{
 
    Sensor_FrequencyHopping_Autotune_Process();
    
    Sensor_setSamplePeriod();
}

/*
 *=========================================================================
 * AFA for ADCC
 *
 *=========================================================================
 */
static void Sensor_FrequencyHopping_Autotune_Process(void)
{
    enum mtouch_sensor_names sensor;
    uint8_t frequencyIndex;
    uint8_t newfrequencyFound,selectedFrequency;
    uint16_t variance,maxVariance;
    
    
    static uint8_t varianceOverLimitCounter[3] = {0,0,0};
    
    maxVariance = 0;
    
    for(sensor = 0; sensor < MTOUCH_SENSORS; sensor++)
    {
        variance = (mtouch_sensor_packetsample_t)abs(packet_sample[sensor] - sensor_medianBuffer[sensor][freq_index]);
        if(variance > maxVariance)
            maxVariance = variance;
    }
    
    if(maxVariance > FH_NOISE_THRS)
    {
        if(++varianceOverLimitCounter[freq_index] >= FH_OVERLIMIT_THRS)
        {
            newfrequencyFound = 0;
            selectedFrequency = freq_hop[freq_index];
            do
            {
                if(selectedFrequency > (MTOUCH_SENSOR_SAMPLEDELAY_MIN + DELAY_CYCLE(1)))
                    selectedFrequency = selectedFrequency - DELAY_CYCLE(1);
                else
                    selectedFrequency = MTOUCH_SENSOR_SAMPLEDELAY_MAX;
                    
                newfrequencyFound = 1;
                
                for(frequencyIndex = 0;frequencyIndex < sizeof(freq_hop);frequencyIndex++)
                {
                    if(frequencyIndex == freq_index)
                    {
                    
                    }
                    else if(selectedFrequency==freq_hop[frequencyIndex])
                    {
                        newfrequencyFound = 0;
                    }
                    else
                    {
                    
                    }
                }
                
            }while(!newfrequencyFound);
            
            freq_hop[freq_index] = selectedFrequency;
            
            for(frequencyIndex = 0;frequencyIndex < sizeof(freq_hop);frequencyIndex++)
            {
                varianceOverLimitCounter[frequencyIndex] = 0;
            }
        }
    }
    else if(maxVariance < (FH_NOISE_THRS >>1)) 
    {
        /* Max variance less than half limit - decrement auto-tune counter if non-zero */
        if(varianceOverLimitCounter[freq_index] > 0)
            varianceOverLimitCounter[freq_index]--;
    }
    else
    {
        /* Keep this frequency */
    }
}

/*
 * =======================================================================
 * Sensor Sampled Callback
 * =======================================================================
 */ 
static void Sensor_DefaultCallback(enum mtouch_sensor_names sensor) { }
void MTOUCH_Sensor_SetSampledCallback(void (*callback)(enum mtouch_sensor_names sensor))
{
    callback_sampled = callback;
}

/*
 * =======================================================================
 *  Enable/Disable Sensor
 * =======================================================================
 * 
 */
void MTOUCH_Sensor_Disable(enum mtouch_sensor_names sensor)
{
    if(sensor < MTOUCH_SENSORS)   
    {
        mtouch_sensor[sensor].enabled = 0;
        mtouch_sensor[sensor].active = 0;
    }
}

void MTOUCH_Sensor_Enable(enum mtouch_sensor_names sensor)
{
    if(sensor < MTOUCH_SENSORS)   
        mtouch_sensor[sensor].enabled = 1;
}

bool MTOUCH_Sensor_isEnabled(enum mtouch_sensor_names sensor)
{
    if(sensor < MTOUCH_SENSORS)   
        return (bool)mtouch_sensor[sensor].enabled;
    else
        return false;
}

static bool Sensor_isEnabled(mtouch_sensor_t* sensor)
{
    if(sensor!=NULL)
        return (bool)sensor->enabled;
    else
        return false;
}

/*
 * =======================================================================
 *  Sensor active status
 * =======================================================================
 * 
 */

static inline void Sensor_setActive(mtouch_sensor_t* sensor)
{
    sensor->active = 1;
}

static inline void Sensor_setInactive(mtouch_sensor_t* sensor)
{
    sensor->active = 0;
}

bool MTOUCH_Sensor_isActive(enum mtouch_sensor_names sensor)
{
    if(sensor<=MTOUCH_SENSORS)
    {
        if(!mtouch_sensor[sensor].sampled)
        {
            
